Repository: FouadEAF/simulateur_facture
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Bill Calculator
ar: حاسبة الفواتير
fr: Calculateur de Facture

source: Settings
ar: الإعدادات
fr: Paramètres

source: Select Bill Type
ar: اختر نوع الفاتورة
fr: Sélectionnez le type de facture

source: Electricity
ar: الكهرباء
fr: Électricité

source: Water
ar: الماء
fr: Eau

source: Electricity Bill Calculator
ar: حاسبة فاتورة الكهرباء
fr: Calculateur de Facture d'Électricité

source: Water Bill Calculator
ar: حاسبة فاتورة الماء
fr: Calculateur de Facture d'Eau

source: Enter Meter Readings
ar: أدخل قراءات العداد
fr: Entrez les relevés de compteur

# oldReading
source: Old Reading ({unit})
ar: القراءة القديمة ({unit})
fr: Ancien Relevé ({unit})

# newReading
source: New Reading ({unit})
ar: القراءة الجديدة ({unit})
fr: Nouveau Relevé ({unit})

# pleaseEnterOldReading
source: Please enter the old reading
ar: الرجاء إدخال القراءة القديمة
fr: Veuillez entrer l'ancien relevé

# pleaseEnterNewReading
source: Please enter the new reading
ar: الرجاء إدخال القراءة الجديدة
fr: Veuillez entrer le nouveau relevé

source: Please enter a valid number
ar: الرجاء إدخال رقم صحيح
fr: Veuillez entrer un nombre valide

source: Calculate
ar: احسب
fr: Calculer

# errorNewReading
source: Error: New reading must be greater than old reading
ar: خطأ: يجب أن تكون القراءة الجديدة أكبر من القراءة القديمة
fr: Erreur : Le nouveau relevé doit être supérieur à l'ancien

source: Consumption
ar: الاستهلاك
fr: Consommation

source: PU
ar: سعر الوحدة

source: Consumption Cost
ar: تكلفة الاستهلاك
fr: Coût de la consommation

source: Redevance Fixe
ar: الإتاوة الثابتة

source: Subtotal
ar: المجموع الفرعي
fr: Sous-total

source: TVA
ar: ضريبة القيمة المضافة

source: Total
ar: المجموع

source: Tranche 1
ar: الشطر 1

source: Tranche 2
ar: الشطر 2

source: Water Cost
ar: تكلفة الماء
fr: Coût de l'eau

source: Assainissement
ar: التطهير

source: Theme
ar: المظهر
fr: Thème

source: System Default
ar: افتراضي النظام
fr: Défaut du système

source: Light
ar: فاتح
fr: Clair

source: Dark
ar: داكن
fr: Sombre

source: Electricity Settings
ar: إعدادات الكهرباء
fr: Paramètres d'électricité

# redevanceFixeElectricite
source: Redevance Fixe Electricité (DH)
ar: الإتاوة الثابتة للكهرباء (درهم)
fr: Redevance Fixe Électricité (DH)

source: Redevance Fixe Facture
ar: الإتاوة الثابتة للفاتورة

source: Water Settings
ar: إعدادات الماء
fr: Paramètres de l'eau

# puTranche1
source: PU Tranche 1 (DH/m³)
ar: سعر الوحدة الشطر 1 (درهم/م³)

# puTranche2
source: PU Tranche 2 (DH/m³)
ar: سعر الوحدة الشطر 2 (درهم/م³)

# redevanceFixeEau
source: Redevance Fixe Eau (DH)
ar: الإتاوة الثابتة للماء (درهم)

# assainissementTranche1
source: Assainissement Tranche 1 (DH/m³)
ar: التطهير الشطر 1 (درهم/م³)

# assainissementTranche2
source: Assainissement Tranche 2 (DH/m³)
ar: التطهير الشطر 2 (درهم/م³)

# redevanceFixeAssainissement
source: Redevance Fixe Assainissement (DH)
ar: الإتاوة الثابتة للتطهير (درهم)

source: Language
ar: اللغة
fr: Langue
